#!/usr/bin/env bash
set -Ceu
#---------------------------------------------------------------------------
# 太字にすると明るくなってしまう問題。
#   明るくも暗くもせず並の輝度で太字にしたいのに、できない。
# CreatedAt: 2021-05-30
#---------------------------------------------------------------------------
Run() {
	echo -e "太字強調しない"
	echo -e "\e[1m太字強調する\e[m"

	echo -e "\e[31m赤\e[m"
	echo -e "\e[91m明るい赤\e[m"

	echo -e "\e[1;31m赤太字強調\e[m"
	echo -e "\e[1;91m明るい赤太字強調\e[m"

	echo -e "\e[2;31m薄くて暗い赤\e[m"
	echo -e "\e[2;91m薄くて明るい赤\e[m"

	echo -e "\e[1;2;31m太字強調＋薄くて暗い赤\e[m"
	echo -e "\e[1;2;91m太字強調＋薄くて明るい赤\e[m"

	echo -e "\e[1;22;31m太字強調＋強調なし＋暗い赤\e[m"
	echo -e "\e[1;22;91m太字強調＋強調なし＋明るい赤\e[m"
}
Run "$@"
